In [3]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', 5400)
# pd.options(repr.matrix.max.rows=6000, repr.matrix.max.cols=200)

In [20]:
swis_10 = pd.read_csv('Switz 10.csv')

In [21]:
swis_10.head()

       Date  swis10_yield
0  11/28/05         2.176
1  11/29/05         2.172
2  11/30/05         2.164
3   12/1/05         2.166
4   12/2/05         2.147

In [22]:
swis_10.Date = pd.to_datetime(swis_10.Date)

In [23]:
swis_10.set_index('Date', inplace=True)

In [24]:
swis_10.head()

            swis10_yield
Date
2005-11-28         2.176
2005-11-29         2.172
2005-11-30         2.164
2005-12-01         2.166
2005-12-02         2.147

In [25]:
us_10 = pd.read_csv('US 10-Year 4577.csv')

In [26]:
us_10.head()

      Date  us10_yield
0  8/16/17       2.227
1  8/15/17       2.273
2  8/14/17       2.224
3  8/13/17       2.199
4  8/11/17       2.191

In [27]:
us_10.Date = pd.to_datetime(us_10.Date)

In [28]:
us_10.set_index('Date', inplace=True)

In [29]:
us_10.head()

            us10_yield
Date
2017-08-16       2.227
2017-08-15       2.273
2017-08-14       2.224
2017-08-13       2.199
2017-08-11       2.191

In [30]:
us_10.shape

(4576, 1)

In [31]:
uk_10 = pd.read_csv('Uk10 6514.csv')

In [32]:
uk_10.head()

       Date  uk10_yield
0  1-Nov-93      7.0536
1  2-Nov-93      7.0289
2  3-Nov-93      6.9850
3  4-Nov-93      6.9859
4  5-Nov-93      7.1002

In [33]:
uk_10.Date = pd.to_datetime(uk_10.Date)

In [34]:
uk_10.set_index('Date', inplace=True)

In [35]:
uk_10.head()

            uk10_yield
Date
1993-11-01      7.0536
1993-11-02      7.0289
1993-11-03      6.9850
1993-11-04      6.9859
1993-11-05      7.1002

In [36]:
uk_10.shape

(6013, 1)

In [37]:
swed_10 = pd.read_csv('10sweden.csv')

In [38]:
swed_10.head()

       Date  swed10_yield
0  11/28/05         3.334
1  11/29/05         3.354
2  11/30/05         3.377
3   12/1/05         3.344
4   12/2/05         3.379

In [39]:
swed_10.Date = pd.to_datetime(swed_10.Date)

In [40]:
swed_10.set_index('Date', inplace=True)

In [41]:
swed_10.head()

            swed10_yield
Date
2005-11-28         3.334
2005-11-29         3.354
2005-11-30         3.377
2005-12-01         3.344
2005-12-02         3.379

In [42]:
swed_10.shape

(3016, 1)

In [43]:
cad_10 = pd.read_csv('Canada 10-Year2998.csv')

In [44]:
cad_10.head()

        Date  can10_yield
0  16-Aug-17        1.879
1  15-Aug-17        1.907
2  14-Aug-17        1.877
3  11-Aug-17        1.852
4  10-Aug-17        1.852

In [45]:
cad_10.Date = pd.to_datetime(cad_10.Date)

In [46]:
cad_10.set_index('Date', inplace=True)

In [47]:
cad_10.head()

            can10_yield
Date
2017-08-16        1.879
2017-08-15        1.907
2017-08-14        1.877
2017-08-11        1.852
2017-08-10        1.852

In [48]:
cad_10.shape

(3147, 1)

In [49]:
eu_10 = pd.read_csv('EU 10 3323.csv')

In [50]:
eu_10.head()

      Date  eu10_yield
0  8/16/17    0.481420
1  8/15/17    0.473368
2  8/14/17    0.445465
3  8/11/17    0.416112
4  8/10/17    0.444193

In [51]:
eu_10.Date = pd.to_datetime(eu_10.Date)

In [52]:
eu_10.set_index('Date', inplace=True)

In [53]:
eu_10.head()

            eu10_yield
Date
2017-08-16    0.481420
2017-08-15    0.473368
2017-08-14    0.445465
2017-08-11    0.416112
2017-08-10    0.444193

In [54]:
eu_10.shape

(3316, 1)

In [55]:
france_10 = pd.read_csv('France 10-Year 4623.csv')

In [56]:
france_10.head()

        Date  fra10_yield
0  16-Aug-17        0.741
1  15-Aug-17        0.730
2  14-Aug-17        0.704
3  11-Aug-17        0.685
4  10-Aug-17        0.710

In [57]:
france_10.Date = pd.to_datetime(france_10.Date)

In [58]:
france_10.set_index('Date', inplace=True)

In [59]:
france_10.head()

            fra10_yield
Date
2017-08-16        0.741
2017-08-15        0.730
2017-08-14        0.704
2017-08-11        0.685
2017-08-10        0.710

In [60]:
france_10.shape

(4622, 1)

In [61]:
ger_10 = pd.read_csv('Germany 10.csv')

In [62]:
ger_10.head()

       Date  ger10_yield
0  11/28/05        3.418
1  11/29/05        3.467
2  11/30/05        3.455
3   12/1/05        3.407
4   12/2/05        3.397

In [63]:
ger_10.Date = pd.to_datetime(ger_10.Date)

In [64]:
ger_10.set_index('Date', inplace=True)

In [65]:
ger_10.head()

            ger10_yield
Date
2005-11-28        3.418
2005-11-29        3.467
2005-11-30        3.455
2005-12-01        3.407
2005-12-02        3.397

In [66]:
ita_10 = pd.read_csv('Italy 10-Year5000.csv')

In [67]:
ita_10.head()

        Date  ita10_yield
0  16-Aug-17        2.043
1  15-Aug-17        2.049
2  14-Aug-17        2.016
3  11-Aug-17        2.029
4  10-Aug-17        2.031

In [68]:
ita_10.Date = pd.to_datetime(ita_10.Date)

In [69]:
ita_10.set_index('Date', inplace=True)

In [70]:
ita_10.head()

            ita10_yield
Date
2017-08-16        2.043
2017-08-15        2.049
2017-08-14        2.016
2017-08-11        2.029
2017-08-10        2.031

In [71]:
ita_10.shape

(5002, 1)

In [72]:
spain_10 = pd.read_csv('Spain 10-Year3220.csv')

In [73]:
spain_10.head()

        Date  spain10_yield
0  16-Aug-17          1.452
1  15-Aug-17          1.467
2  14-Aug-17          1.430
3  11-Aug-17          1.454
4  10-Aug-17          1.451

In [74]:
spain_10.Date = pd.to_datetime(spain_10.Date)

In [75]:
spain_10.set_index('Date', inplace=True)

In [76]:
spain_10.head()

            spain10_yield
Date
2017-08-16          1.452
2017-08-15          1.467
2017-08-14          1.430
2017-08-11          1.454
2017-08-10          1.451

In [77]:
spain_10.shape

(3219, 1)

In [78]:
aus_10 = pd.read_csv('Australia 10-Year.csv')

In [79]:
aus_10.head()

       Date  aus10_yield
0  11/28/05        5.369
1  11/29/05        5.348
2  11/30/05        5.377
3   12/1/05        5.388
4   12/2/05        5.362

In [80]:
aus_10.Date = pd.to_datetime(aus_10.Date)

In [81]:
aus_10.set_index('Date', inplace=True)

In [82]:
aus_10.head()

            aus10_yield
Date
2005-11-28        5.369
2005-11-29        5.348
2005-11-30        5.377
2005-12-01        5.388
2005-12-02        5.362

In [83]:
aus_10.shape

(3004, 1)

In [84]:
china_10 = pd.read_csv('China 10-Year2900.csv')

In [85]:
china_10.head()

        Date  china10_yield
0  16-Aug-17          3.624
1  15-Aug-17          3.618
2  14-Aug-17          3.631
3  11-Aug-17          3.640
4  10-Aug-17          3.676

In [86]:
china_10.Date = pd.to_datetime(china_10.Date)

In [87]:
china_10.set_index('Date', inplace=True)

In [88]:
china_10.tail()

            china10_yield
Date
2006-05-25          2.958
2006-05-26          2.960
2006-05-29          2.987
2006-05-30          2.987
2006-05-31          2.982

In [89]:
china_10.shape

(2936, 1)

In [92]:
all_yields = us_10.join([uk_10, swis_10, eu_10, cad_10, swed_10, ger_10, france_10, ita_10, aus_10], how='outer')

In [93]:
all_yields.to_csv('all_yields.csv')